---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterInverseRule
source: html/c1099895-f50b-b929-549d-04e55d04decf.htm
---
# FilterInverseRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.